ubinos/ubinos/source/ubinos/bsp/arch/arm/cortexm/stm32f769/gcc_startup_stm32f769xx.S
/**
  ******************************************************************************
  * @file      startup_stm32f769xx.s
  * @author    MCD Application Team
  * @brief     STM32F769xx Devices vector table for GCC based toolchain. 
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M7 processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
    
#include <ubinos_config.h>

#if (INCLUDE__UBINOS__BSP == 1)
#if (UBINOS__BSP__CPU_MODEL__STM32F7XX == 1)

  .syntax unified
  .cpu cortex-m7
  .fpu softvfp
  .thumb

    .section .stack
#if defined(__STACK_SIZE)
    .align 3
    .equ    Stack_Size, __STACK_SIZE
#else
    .align 3
    .equ    Stack_Size, 8192
#endif
    .globl __StackTop
    .globl __StackLimit
__StackLimit:
    .space Stack_Size
    .size __StackLimit, . - __StackLimit
__StackTop:
    .size __StackTop, . - __StackTop

    .section .isr_vector
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                  /* Top of Stack */
    .long   Reset_Handler
#if (INCLUDE__UBINOS__UBIK == 1)
    .long   bsp_ubik_irq_handler        /* NMI_Handler */
    .long   bsp_ubik_irq_handler        /* HardFault_Handler */
    .long   bsp_ubik_irq_handler        /* MemoryManagement_Handler */
    .long   bsp_ubik_irq_handler        /* BusFault_Handler */
    .long   bsp_ubik_irq_handler        /* UsageFault_Handler */
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   bsp_ubik_swi_handler        /* SVC_Handler */
    .long   bsp_ubik_irq_handler        /* DebugMon_Handler */
    .long   0                           /* Reserved */
    .long   bsp_ubik_psv_handler        /* PendSV_Handler */
    .long   bsp_ubik_tick_handler       /* SysTick_Handler */
#else
    .long   NMI_Handler
    .long   HardFault_Handler
    .long   MemManage_Handler
    .long   BusFault_Handler
    .long   UsageFault_Handler
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   0                           /* Reserved */
    .long   SVC_Handler
    .long   DebugMon_Handler
    .long   0                           /* Reserved */
    .long   PendSV_Handler
    .long   SysTick_Handler
#endif /* (INCLUDE__UBINOS__UBIK == 1) */

  /* External Interrupts */
    .long   WWDG_IRQHandler                   /* Window WatchDog              */
    .long   PVD_IRQHandler                    /* PVD through EXTI Line detection */
    .long   TAMP_STAMP_IRQHandler             /* Tamper and TimeStamps through the EXTI line */
    .long   RTC_WKUP_IRQHandler               /* RTC Wakeup through the EXTI line */
    .long   FLASH_IRQHandler                  /* FLASH                        */
    .long   RCC_IRQHandler                    /* RCC                          */
    .long   EXTI0_IRQHandler                  /* EXTI Line0                   */
    .long   EXTI1_IRQHandler                  /* EXTI Line1                   */
    .long   EXTI2_IRQHandler                  /* EXTI Line2                   */
    .long   EXTI3_IRQHandler                  /* EXTI Line3                   */
    .long   EXTI4_IRQHandler                  /* EXTI Line4                   */
    .long   DMA1_Stream0_IRQHandler           /* DMA1 Stream 0                */
    .long   DMA1_Stream1_IRQHandler           /* DMA1 Stream 1                */
    .long   DMA1_Stream2_IRQHandler           /* DMA1 Stream 2                */
    .long   DMA1_Stream3_IRQHandler           /* DMA1 Stream 3                */
    .long   DMA1_Stream4_IRQHandler           /* DMA1 Stream 4                */
    .long   DMA1_Stream5_IRQHandler           /* DMA1 Stream 5                */
    .long   DMA1_Stream6_IRQHandler           /* DMA1 Stream 6                */
    .long   ADC_IRQHandler                    /* ADC1, ADC2 and ADC3s         */
    .long   CAN1_TX_IRQHandler                /* CAN1 TX                      */
    .long   CAN1_RX0_IRQHandler               /* CAN1 RX0                     */
    .long   CAN1_RX1_IRQHandler               /* CAN1 RX1                     */
    .long   CAN1_SCE_IRQHandler               /* CAN1 SCE                     */
    .long   EXTI9_5_IRQHandler                /* External Line[9:5]s          */
    .long   TIM1_BRK_TIM9_IRQHandler          /* TIM1 Break and TIM9          */
    .long   TIM1_UP_TIM10_IRQHandler          /* TIM1 Update and TIM10        */
    .long   TIM1_TRG_COM_TIM11_IRQHandler     /* TIM1 Trigger and Commutation and TIM11 */
    .long   TIM1_CC_IRQHandler                /* TIM1 Capture Compare         */
    .long   TIM2_IRQHandler                   /* TIM2                         */
    .long   TIM3_IRQHandler                   /* TIM3                         */
    .long   TIM4_IRQHandler                   /* TIM4                         */
    .long   I2C1_EV_IRQHandler                /* I2C1 Event                   */
    .long   I2C1_ER_IRQHandler                /* I2C1 Error                   */
    .long   I2C2_EV_IRQHandler                /* I2C2 Event                   */
    .long   I2C2_ER_IRQHandler                /* I2C2 Error                   */
    .long   SPI1_IRQHandler                   /* SPI1                         */
    .long   SPI2_IRQHandler                   /* SPI2                         */
    .long   USART1_IRQHandler                 /* USART1                       */
    .long   USART2_IRQHandler                 /* USART2                       */
    .long   USART3_IRQHandler                 /* USART3                       */
    .long   EXTI15_10_IRQHandler              /* External Line[15:10]s        */
    .long   RTC_Alarm_IRQHandler              /* RTC Alarm (A and B) through EXTI Line */
    .long   OTG_FS_WKUP_IRQHandler            /* USB OTG FS Wakeup through EXTI line */
    .long   TIM8_BRK_TIM12_IRQHandler         /* TIM8 Break and TIM12         */
    .long   TIM8_UP_TIM13_IRQHandler          /* TIM8 Update and TIM13        */
    .long   TIM8_TRG_COM_TIM14_IRQHandler     /* TIM8 Trigger and Commutation and TIM14 */
    .long   TIM8_CC_IRQHandler                /* TIM8 Capture Compare         */
    .long   DMA1_Stream7_IRQHandler           /* DMA1 Stream7                 */
    .long   FMC_IRQHandler                    /* FMC                          */
    .long   SDMMC1_IRQHandler                 /* SDMMC1                       */
    .long   TIM5_IRQHandler                   /* TIM5                         */
    .long   SPI3_IRQHandler                   /* SPI3                         */
    .long   UART4_IRQHandler                  /* UART4                        */
    .long   UART5_IRQHandler                  /* UART5                        */
    .long   TIM6_DAC_IRQHandler               /* TIM6 and DAC1&2 underrun errors */
    .long   TIM7_IRQHandler                   /* TIM7                         */
    .long   DMA2_Stream0_IRQHandler           /* DMA2 Stream 0                */
    .long   DMA2_Stream1_IRQHandler           /* DMA2 Stream 1                */
    .long   DMA2_Stream2_IRQHandler           /* DMA2 Stream 2                */
    .long   DMA2_Stream3_IRQHandler           /* DMA2 Stream 3                */
    .long   DMA2_Stream4_IRQHandler           /* DMA2 Stream 4                */
    .long   ETH_IRQHandler                    /* Ethernet                     */
    .long   ETH_WKUP_IRQHandler               /* Ethernet Wakeup through EXTI line */
    .long   CAN2_TX_IRQHandler                /* CAN2 TX                      */
    .long   CAN2_RX0_IRQHandler               /* CAN2 RX0                     */
    .long   CAN2_RX1_IRQHandler               /* CAN2 RX1                     */
    .long   CAN2_SCE_IRQHandler               /* CAN2 SCE                     */
    .long   OTG_FS_IRQHandler                 /* USB OTG FS                   */
    .long   DMA2_Stream5_IRQHandler           /* DMA2 Stream 5                */
    .long   DMA2_Stream6_IRQHandler           /* DMA2 Stream 6                */
    .long   DMA2_Stream7_IRQHandler           /* DMA2 Stream 7                */
    .long   USART6_IRQHandler                 /* USART6                       */
    .long   I2C3_EV_IRQHandler                /* I2C3 event                   */
    .long   I2C3_ER_IRQHandler                /* I2C3 error                   */
    .long   OTG_HS_EP1_OUT_IRQHandler         /* USB OTG HS End Point 1 Out   */
    .long   OTG_HS_EP1_IN_IRQHandler          /* USB OTG HS End Point 1 In    */
    .long   OTG_HS_WKUP_IRQHandler            /* USB OTG HS Wakeup through EXTI */
    .long   OTG_HS_IRQHandler                 /* USB OTG HS                   */
    .long   DCMI_IRQHandler                   /* DCMI                         */
    .long   0                                 /* Reserved                     */
    .long   RNG_IRQHandler                    /* RNG                          */
    .long   FPU_IRQHandler                    /* FPU                          */
    .long   UART7_IRQHandler                  /* UART7                        */
    .long   UART8_IRQHandler                  /* UART8                        */
    .long   SPI4_IRQHandler                   /* SPI4                         */
    .long   SPI5_IRQHandler                   /* SPI5                         */
    .long   SPI6_IRQHandler                   /* SPI6                         */
    .long   SAI1_IRQHandler                   /* SAI1                         */
    .long   LTDC_IRQHandler                   /* LTDC                         */
    .long   LTDC_ER_IRQHandler                /* LTDC error                   */
    .long   DMA2D_IRQHandler                  /* DMA2D                        */
    .long   SAI2_IRQHandler                   /* SAI2                         */
    .long   QUADSPI_IRQHandler                /* QUADSPI                      */
    .long   LPTIM1_IRQHandler                 /* LPTIM1                       */
    .long   CEC_IRQHandler                    /* HDMI_CEC                     */
    .long   I2C4_EV_IRQHandler                /* I2C4 Event                   */
    .long   I2C4_ER_IRQHandler                /* I2C4 Error                   */
    .long   SPDIF_RX_IRQHandler               /* SPDIF_RX                     */
    .long   DSI_IRQHandler                    /* DSI                          */
    .long   DFSDM1_FLT0_IRQHandler            /* DFSDM1 Filter 0 global Interrupt */
    .long   DFSDM1_FLT1_IRQHandler            /* DFSDM1 Filter 1 global Interrupt */
    .long   DFSDM1_FLT2_IRQHandler            /* DFSDM1 Filter 2 global Interrupt */
    .long   DFSDM1_FLT3_IRQHandler            /* DFSDM1 Filter 3 global Interrupt */
    .long   SDMMC2_IRQHandler                 /* SDMMC2                       */
    .long   CAN3_TX_IRQHandler                /* CAN3 TX                      */
    .long   CAN3_RX0_IRQHandler               /* CAN3 RX0                     */
    .long   CAN3_RX1_IRQHandler               /* CAN3 RX1                     */
    .long   CAN3_SCE_IRQHandler               /* CAN3 SCE                     */
    .long   JPEG_IRQHandler                   /* JPEG                         */
    .long   MDIOS_IRQHandler                  /* MDIOS                        */

    .size __isr_vector, . - __isr_vector


/* Reset Handler */

    .text
    .thumb
    .thumb_func
    .align 1
    .globl Reset_Handler
    .type Reset_Handler, %function
Reset_Handler:
/* set stack pointer */
    ldr sp, =__StackTop

